#This code load the data from MongoDB, changes it, and saves it to Postgresql.

# FETCHING DATA FROM MONGODB

In [88]:
# IMPORTING REQUIRED LIBRARIES
import pandas as pd
from pymongo import MongoClient
from sqlalchemy import create_engine

# connect to Mongo db
mongo = MongoClient('mongodb://localhost:27017/')
my_database = mongo['life_expectancy_db']
my_collection = my_database['life_expectancy']

In [89]:
# collect all data and convert it in a list for dataframe
all_data = my_collection.find()
data_list = []
for item in all_data:
    data_list.append(item)

In [90]:
# Make a DataFrame with the data
my_dataframe = pd.DataFrame(data_list)
print("DATA COLLETCED FROM MONGO DB")

DATA COLLETCED FROM MONGO DB

In [91]:
my_dataframe.head()

                        _id      Country  Year  Life Expectancy
0  67fcc97e0331f8156c49949b  Afghanistan  1950          28.1563
1  67fcc97e0331f8156c49949c  Afghanistan  1951          28.5836
2  67fcc97e0331f8156c49949d  Afghanistan  1952          29.0138
3  67fcc97e0331f8156c49949e  Afghanistan  1953          29.4521
4  67fcc97e0331f8156c49949f  Afghanistan  1954          29.6975

# DATA CLEANING

In [93]:
# removing id column
my_dataframe = my_dataframe.drop('_id', axis=1)

# round life expectancy
my_dataframe['Life Expectancy'] = my_dataframe['Life Expectancy'].round(2)

In [94]:
my_dataframe.head()

       Country  Year  Life Expectancy
0  Afghanistan  1950            28.16
1  Afghanistan  1951            28.58
2  Afghanistan  1952            29.01
3  Afghanistan  1953            29.45
4  Afghanistan  1954            29.70

# DATA ANALYSIS

In [96]:
# Find average life expectancy for each country
average_data = my_dataframe.groupby('Country')['Life Expectancy'].mean()
average_data = average_data.round(2) 
average_data = average_data.reset_index() 

# Show top 5 and bottom 5 countries

top_five = average_data.sort_values('Life Expectancy', ascending=False).head(5)

bottom_five = average_data.sort_values('Life Expectancy', ascending=True).head(5)

print("TOP 5 COUNTRIES:")
print(top_five)
print("")
print("BOTTOM FIVE COUNTRIES:")
print(bottom_five)

TOP 5 COUNTRIES:
           Country  Life Expectancy
156         Monaco            78.05
207     San Marino            78.00
6          Andorra            77.99
92        Guernsey            77.00
133  Liechtenstein            76.29

BOTTOM FIVE COUNTRIES:
          Country  Life Expectancy
245          USSR            32.70
224   South Sudan            37.84
214  Sierra Leone            43.19
145          Mali            43.76
171         Niger            44.19

# Save processed data to PostgreSQL

In [98]:
my_engine = create_engine("postgresql://postgres:root@localhost:5432/postgres")

In [99]:

# Save the main data to a table
my_dataframe.to_sql('life_expectancy', my_engine, if_exists='replace', index=False)
print("Main data saved to PostgreSQL!")

Main data saved to PostgreSQL!

In [100]:
# Step 6: Show some info about my data
print("Info about my main DataFrame:")
print(my_dataframe.info())
print("")  # Empty line
print("Info about my average DataFrame:")
print(average_data.info())

Info about my main DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21565 entries, 0 to 21564
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          21565 non-null  object
 1   Year             21565 non-null  int64
 2   Life Expectancy  21565 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 505.6+ KB
None

Info about my average DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265 entries, 0 to 264
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          265 non-null    object
 1   Life Expectancy  265 non-null    float64
dtypes: float64(1), object(1)
memory usage: 4.3+ KB
None